Catalogs/РС_КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КонтактныеЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_КонтактныеЛица/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛица.Ссылка КАК Ссылка,
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	КонтактныеЛица.Фамилия КАК Фамилия,
		|	КонтактныеЛица.Имя КАК Имя,
		|	КонтактныеЛица.Отчество КАК Отчество,
		|	КонтактныеЛица.ДатаРождения КАК ДатаРождения,
		|	КонтактныеЛица.ОбъектВладелец КАК КонтрагентБД
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец ССЫЛКА Справочник.Контрагенты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"	, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("Фамилия"		, ВыборкаДетальныеЗаписи.Фамилия);
		Структура.Вставить("Имя"			, ВыборкаДетальныеЗаписи.Имя);
		Структура.Вставить("Отчество"		, ВыборкаДетальныеЗаписи.Отчество);
		Структура.Вставить("ДатаРождения"	, ВыборкаДетальныеЗаписи.ДатаРождения);
		Структура.Вставить("КонтрагентБД"	, ВыборкаДетальныеЗаписи.КонтрагентБД);
		
		КонтактноеЛицоРС = СоздатьКонтактноеЛицоРС(Структура); 
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтактноеЛицоРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьКонтактноеЛицоРС(Структура)
			
	ПоискКЛ = НайтиКонтактноеЛицо(Структура);
	
	Если ЗначениеЗаполнено(ПоискКЛ) Тогда 
		НовыйЭлемент = ПоискКЛ.ПолучитьОбъект();
	Иначе
		НовыйЭлемент = Справочники.РС_КонтактныеЛица.СоздатьЭлемент();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура);
		
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции  

&НаСервере
Функция НайтиКонтактноеЛицо(Структура)
	
	ПоискКЛ = Справочники.РС_КонтактныеЛица.ПустаяСсылка();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_КонтактныеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РС_КонтактныеЛица КАК РС_КонтактныеЛица
		|ГДЕ
		|	РС_КонтактныеЛица.КонтрагентБД = &КонтрагентБД
		|	И РС_КонтактныеЛица.Имя = &Имя
		|	И РС_КонтактныеЛица.Фамилия = &Фамилия
		|	И РС_КонтактныеЛица.Отчество = &Отчество
		|	И РС_КонтактныеЛица.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("ДатаРождения", Структура.ДатаРождения);
	Запрос.УстановитьПараметр("Имя"			, Структура.Имя);
	Запрос.УстановитьПараметр("КонтрагентБД", Структура.КонтрагентБД);
	Запрос.УстановитьПараметр("Отчество"	, Структура.Отчество);
	Запрос.УстановитьПараметр("Фамилия"		, Структура.Фамилия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискКЛ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	 
	 Возврат ПоискКЛ;
	
КонецФункции;
